{
  "home": {
    "sobre": "About",
    "descricao": "Undergraduate student in Computer Science at the Federal University of Minas Gerais (UFMG).",
    "descricao2": "Main Skills",
    "linguagens": "Languages",
    "bibliotecas": "Libraries",
    "outrasTecnologias": "Other Technologies",
    "interesses": "With solid experience in security architecture for GSI and MPMG systems, and in the development of neural networks for one of the largest radiography companies in Brazil, he has a proactive and dedicated profile, with a great interest in Cybersecurity and Artificial Intelligence.",
    "interesses2": "He faces challenges with determination, seeks creative solutions to complex problems, and, when he doesn't master some knowledge, commits to learning it quickly.",
    "btnTrabalhos": "See the works"
  },
  "header": {
    "trabalhos": "Projects",
    "curriculo": "Resume",
    "contato": "Contact"
  },
  "footer": {
    "texto1": "Developed by Henrique Rotsen",
    "texto2": "All rights reserved"
  },
  "trabalhos": {
    "titulo": "Main Projects",
    "ciberseguranca": "Cybersecurity",
    "ciberseguranca_desc": "Researcher in the field of Security Architecture, focused on the planning and development of Safety by Design (SbD) and Privacy by Design (PbD) systems. Recently, he carried out a project that involved static (SAST) and dynamic (DAST) vulnerability analysis in the systems of the Public Prosecutor's Office of Minas Gerais (MPMG) and the Integrated Security Office (GSI). Additionally, with an article published in the Integrated Software and Hardware Seminar (SEMISH) 2025.",
    "mineracao": "Data Mining",
    "mineracao_desc": "A project focused on discovering patterns in apartment rental data in the USA. Several data cleaning and analysis techniques were applied and discussed in the report available below.",
    "analise": "EXPLORATORY DATA ANALYSIS",
    "itemsets": "ITEMSET MINING",
    "subgrupos": "SUBGROUP DISCOVERY",
    "analise_desc": "Mapped the average prices of apartments in the U.S. and identified areas where high-priced apartments are concentrated.",
    "itemsets_desc": "We identified significant patterns among the amenities offered in apartments, revealing frequent and relevant associations between itemsets.",
    "subgrupos_desc": "We identified relevant subgroups for analysis, aiming to understand the relationship between certain offered amenities and the type of apartment and the region it is part of.",
    "veja_trabalho": "See Project",
    "simplex": "Optimization - Simplex",
    "simplex_desc": "Developed by George Dantzig in 1947, the Simplex algorithm is a powerful and efficient method for solving linear programming problems. This work was developed during the Operations Research course (DCC035), taught by Professor Cristiano Arbex Valle (PhD in Applied Mathematics). The project was implemented in Python and uses the extended LP model, providing optimality/infeasibility certificates. Thus, it can solve various LPs with great performance.",
    "gps": "Data Analysis - GPS Fórmula UFMG",
    "gps_desc": "A GPS system was developed for the UFMG racing team’s car. This system used the following technologies: Arduino, C++, U-blox NEO-6M GPS, Google Colab, Python, Pandas, Folium, Plotly, and TinyGPS.",
    "gps_desc2": "The development was end-to-end, from assembling the components on Arduino to processing and analyzing the collected data. You can view the analyses and even test the code with other GPS data in the same U-blox format.",
    "desenv_software": "Software Development",
    "desenv_software_desc": "Several works have been done in this area. Also works on the development of...",
    "foodfit_desc": "Diet generation system using Artificial Intelligence via ChatGPT API, built with JavaScript and React.",
    "comanda_desc": "Individual tab system for bars and customers, aimed at simplifying bill splitting, built with JavaScript, TypeScript, and Vue.",
    "santiago_desc": "Internal software for contract management and monitoring at Santiago Cotton LTDA, developed in C# using .NET framework with Windows Forms.",
    "ia": "Artificial Intelligence",
    "ia_desc": "Works as a developer at Radio Memory, focusing on neural network development and supporting AI innovations aimed at radiology solutions."
},
  "curriculo": {
    "titulo": "Resume Models",
    "cv": "Curriculum Vitae",
    "baixar": "Download",
    "idiomaPt": "Portuguese (PT/BR)",
    "idiomaEn": "English (EN/US)"
  },
  "contato": {
    "titulo": "Contact",
    "placeholderNome": "Enter your name",
    "placeholderEmail": "Enter your email",
    "placeholderMensagem": "Enter your message",
    "botao": "Send",
    "erroNome": "Please enter your name.",
    "erroEmail": "Please enter your email.",
    "erroMensagem": "Please enter your message.",
    "emailSucesso": "Email sent successfully!",
    "emailErro": "Failed to send email. Error:"
  }
}